Tekla Open API Reference for Tekla Structures 2025
ParametricProfileItem.SelectByTypeAndSubtype Method
 Selects the parametric profile item in the profile database using the given type and subtype.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SelectByTypeAndSubtype(
	string profileName,
	ProfileItem.ProfileItemTypeEnum type,
	ProfileItem.ProfileItemSubTypeEnum subtype
)
Public Function SelectByTypeAndSubtype (
	profileName As String,
	type As ProfileItem.ProfileItemTypeEnum,
	subtype As ProfileItem.ProfileItemSubTypeEnum
) As Boolean
Parameters
profileName
Type: System.String
The profile name.
type
Type: Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum
The profile item type.
subtype
Type: Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum
The profile item subtype.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Tekla.Structures.Catalogs.ParametricProfileItem.SelectByTypeAndSubtype(System.String,Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum,Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum)"]
See Also
Reference
ParametricProfileItem Class
Tekla.Structures.Catalogs Namespace